
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        1 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                   |
|:--------:|:------------------------------------------------------------|
|    🟢    | `module.infrahouse_com.aws_route53_record._gh-infrahouse-o` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrahouse_com.aws_route53_record._gh-infrahouse-o will be created
  + resource "aws_route53_record" "_gh-infrahouse-o" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_gh-infrahouse-o.infrahouse.com"
      + records         = [
          + "4e1245e5cc",
        ]
      + ttl             = 3600
      + type            = "TXT"
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>